#+STARTUP: overview num indent show2levels
#+TODO: TODO(t) DONE
#+TODO: VERBOSE-ON VERBOSE-OFF | 

*DO THIS FIRST*: Setting the tangle target directory at [[*buffer local variables (must be the last)][here]].

If there's a special tag on the heading. Type S-<left><right> to
switch code branches.

Type C-c C-v t to tangle emacs init files.

** get the full pathname of *THIS* org init file
When using :var header in code blocks, the tangled code doesn't just replace
text like a MACRO, but use a 'let()' block to set a variable, which is not
what we want.
So we use :noweb as below.

#+NAME: ORG-INIT-FILE
#+begin_src emacs-lisp
  (buffer-file-name)
#+end_src

#+RESULTS: ORG-INIT-FILE
: c:/Users/InnerSea/pyprojs/autohotkey_scripts/emacs-init.org

** confirm the branch-tags for tangling
A branch-tag is a set of TODO-tags indicating certain code blocks
while tangling. This code keeps the tags from disappearing when using
S-<left> or S-<right> to switch code branches.

#+NAME: confirm-branch
#+begin_src emacs-lisp
  (let ((branch-tags nil)
    (tags nil)
    (return nil))
    (defun confirm-branch-tags (new-mark old-mark)
      (setq branch-tags '(("VERBOSE-ON" . "VERBOSE-OFF")
                          ("1" . "2")))
      (while (and (setq tags (car branch-tags))
                  (not (setq return
                             (cond ((string= old-mark (car tags)) (cdr tags))
                                   ((string= old-mark (cdr tags)) (car tags))))))
        (setq branch-tags (cdr branch-tags)))
      return)

    (add-hook 'org-todo-get-default-hook 'confirm-branch-tags nil t))
#+end_src

#+RESULTS: confirm-branch
| confirm-branch-tags | t |

